In [1]:
import pandas as pd
import numpy as np
from googletrans import Translator

In [2]:
df=pd.read_csv("amazon.csv",thousands=".")

In [ ]:
print(df)

In [ ]:
df.head()

In [ ]:
df.tail(20)

In [3]:
df=df.replace(0,np.nan)

In [ ]:
df

In [ ]:
df.tail()

In [ ]:
df

In [4]:
df2=df.dropna(subset=["number"])

In [ ]:
df2

In [5]:
df2.describe(include="all")

               year state    month        number      date
count   5837.000000  5837     5837   5837.000000      5837
unique          NaN    23       12           NaN        20
top             NaN   Rio  Outubro           NaN  1/1/2016
freq            NaN   661      534           NaN       317
mean    2007.834847   NaN      NaN    577.947918       NaN
std        5.649076   NaN      NaN   1625.176973       NaN
min     1998.000000   NaN      NaN      1.000000       NaN
25%     2003.000000   NaN      NaN     16.000000       NaN
50%     2008.000000   NaN      NaN     72.000000       NaN
75%     2013.000000   NaN      NaN    334.000000       NaN
max     2017.000000   NaN      NaN  25963.000000       NaN

In [6]:
forest_fire_month=df2.groupby('month')['number'].sum()
forest_fire_month

month
Abril          28364.0
Agosto        740841.0
Dezembro      152596.0
Fevereiro      30952.0
Janeiro        52587.0
Julho         217620.0
Junho         111405.0
Maio           46083.0
Março          35118.0
Novembro      312326.0
Outubro       629665.0
Setembro     1015925.0
Name: number, dtype: float64

In [ ]:
print(forest_fire_month)

In [8]:

months_unique = list(df.month.unique())


forest_fire_month=forest_fire_month.reindex(months_unique,axis=0)

In [9]:
forest_fire_month

month
Janeiro        52587.0
Fevereiro      30952.0
Março          35118.0
Abril          28364.0
Maio           46083.0
Junho         111405.0
Julho         217620.0
Agosto        740841.0
Setembro     1015925.0
Outubro       629665.0
Novembro      312326.0
Dezembro      152596.0
Name: number, dtype: float64

In [10]:
forest_fire_month=forest_fire_month.to_frame()

In [11]:
forest_fire_month.reset_index(level=0,inplace=True)

In [12]:
forest_fire_month

        month     number
0     Janeiro    52587.0
1   Fevereiro    30952.0
2       Março    35118.0
3       Abril    28364.0
4        Maio    46083.0
5       Junho   111405.0
6       Julho   217620.0
7      Agosto   740841.0
8    Setembro  1015925.0
9     Outubro   629665.0
10   Novembro   312326.0
11   Dezembro   152596.0

In [14]:
translator = Translator() #create an object of Translator 
for month in months_unique: 
    detected = translator.detect(month)     
    translated = translator.translate(month)     
    print(detected)     
    print(translated)     
    print("...")

Detected(lang=en, confidence=0.6906946)
Translated(src=en, dest=en, text=Janeiro, pronunciation=Janeiro, extra_data="{'translat...")
...
Detected(lang=pt, confidence=1)
Translated(src=pt, dest=en, text=February, pronunciation=February, extra_data="{'translat...")
...
Detected(lang=pt, confidence=1)
Translated(src=pt, dest=en, text=March, pronunciation=March, extra_data="{'translat...")
...
Detected(lang=es, confidence=0.47058824)
Translated(src=es, dest=en, text=April, pronunciation=April, extra_data="{'translat...")
...
Detected(lang=pt, confidence=0.75)
Translated(src=pt, dest=en, text=May, pronunciation=May, extra_data="{'translat...")
...
Detected(lang=pt, confidence=1)
Translated(src=pt, dest=en, text=June, pronunciation=June, extra_data="{'translat...")
...
Detected(lang=pt, confidence=1)
Translated(src=pt, dest=en, text=July, pronunciation=July, extra_data="{'translat...")
...
Detected(lang=es, confidence=0.37796605)
Translated(src=es, dest=en, text=August, pronunciation=August, extra_data="{'translat...")
...
Detected(lang=pt, confidence=0.8515625)
Translated(src=pt, dest=en, text=September, pronunciation=September, extra_data="{'translat...")
...
Detected(lang=pt, confidence=0.97583973)
Translated(src=pt, dest=en, text=October, pronunciation=October, extra_data="{'translat...")
...
Detected(lang=pt, confidence=0.78125)
Translated(src=pt, dest=en, text=November, pronunciation=November, extra_data="{'translat...")
...
Detected(lang=pt, confidence=1)
Translated(src=pt, dest=en, text=December, pronunciation=December, extra_data="{'translat...")
...

In [17]:
print(translated.text)

December

In [18]:
df2

      year      state     month  number      date
5     2003       Acre   Janeiro    10.0  1/1/2003
7     2005       Acre   Janeiro    12.0  1/1/2005
8     2006       Acre   Janeiro     4.0  1/1/2006
12    2010       Acre   Janeiro     1.0  1/1/2010
17    2015       Acre   Janeiro     1.0  1/1/2015
...    ...        ...       ...     ...       ...
6449  2012  Tocantins  Dezembro   128.0  1/1/2012
6450  2013  Tocantins  Dezembro    85.0  1/1/2013
6451  2014  Tocantins  Dezembro   223.0  1/1/2014
6452  2015  Tocantins  Dezembro   373.0  1/1/2015
6453  2016  Tocantins  Dezembro   119.0  1/1/2016

[5837 rows x 5 columns]

In [21]:
translator1= Translator()
for i , m in enumerate (forest_fire_month['month']):
    translated = translator1.translate(m)  
    month1 = translated.text    
    forest_fire_month.at[i, 'month'] = month1

In [22]:
print(forest_fire_month)

        month     number
0     Janeiro    52587.0
1    February    30952.0
2       March    35118.0
3       April    28364.0
4         May    46083.0
5        June   111405.0
6        July   217620.0
7      August   740841.0
8   September  1015925.0
9     October   629665.0
10   November   312326.0
11   December   152596.0